app/common/base/UserToken.php

    public static function updataToken($uid)
    {
        $token = self::find()->where('uid=:uid', [':uid' => $uid])->one();
        $params = [
            'token' => md5(time()),
            'expired' => time() + 7 * 24 * 60 * 60, //7 days
        ];
        if (!$token) {
            $token = new UserToken();
            $params['uid'] = strval($uid);
        }
        $token->setAttributes($params, false);
        $token->save();
---
INSERT INTO `yx_user_token` (`token`, `expired`, `uid`) VALUES ('ed6b1e0a267f004369abe826e2cae6ad', 1522664752, '1')
UPDATE `yx_user_token` SET `token`='42dff4ffdf74c1e58e0ed5342835aa12', `expired`=1522664766 WHERE `id`=2