app/backend/modules/user/controllers/UserController.php

    public function actionIndex()
    {
        $id = $this->decodeID('uid');
        $this->isRequired([], true);
        $model = User::find()->where('id=:uid', [':uid' => $id])->asArray()->one();
---
SELECT * FROM `yx_user` WHERE uid=1